lib/tasks/admin.rake

desc "SET ADMIN"
namespace :users do
  task(:add_admin, [:email] => :environment) do |t, args|
    user = User.find_by(email: args[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lol@gmail.com"], ["LIMIT", 1]]