app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order('name ASC')
---
SELECT "categories".* FROM "categories" ORDER BY name ASC

  def search_movies
    @movies = @category.movies.page(params[:page])
---
SELECT  "movies".* FROM "movies" INNER JOIN "categories_movies" ON "movies"."id" = "categories_movies"."movie_id" WHERE "categories_movies"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 4], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "movies" INNER JOIN "categories_movies" ON "movies"."id" = "categories_movies"."movie_id" WHERE "categories_movies"."category_id" = $1  [["category_id", 5]]

  def create
    authorize!
    category = Category.new(category_params)
    if category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "lalala"], ["created_at", "2022-12-24 20:33:12.938037"], ["updated_at", "2022-12-24 20:33:12.938037"]]

  def destroy
    authorize! @category
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 16]]

  def find_category
    @category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]