app/controllers/movies_controller.rb

   def index
     @movies = Movie.page(params[:page])
---
SELECT COUNT(*) FROM "movies"
SELECT  "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

   def new
     @movie = Movie.new
     categories = Category.all
     @categories_mapping = Hash.new.tap do |hash|
        categories.each { |category| hash[category.name] = category.id}
---
SELECT "categories".* FROM "categories"

  def create
    authorize!
    @movie = Movie.new(movie_params)

    params["movie"]["categories"].each do |category_id|
      if category_id.present?
        category = Category.find(category_id)
        @movie.categories << category
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "description", "title_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    authorize! @movie
    if @movie.update(movie_params)
---
UPDATE "movies" SET "updated_at" = $1, "title" = $2 WHERE "movies"."id" = $3  [["updated_at", "2022-12-24 16:50:32.688737"], ["title", "he Shawshank Redemption"], ["id", 1]]

  def destroy
    authorize! @movie
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 15]]

  def find_movie
    @movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def save_movie
    if @movie.save
---
INSERT INTO "movies" ("title", "description", "title_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def find_category
   @categories_ids = @movie.categories.map(&:id)
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_movies" ON "categories"."id" = "categories_movies"."category_id" WHERE "categories_movies"."movie_id" = $1  [["movie_id", 1]]