app/controllers/sessions_controller.rb

  def login
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "alinapaik143@gmail.com"], ["LIMIT", 1]]