app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
   if user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find(params[:id])
    authorize! @user
    if @user.update(user_update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-12-24 17:56:19.216934"], ["username", "keklol"], ["id", 1]]

  def find_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]